testsrc/main/mondrian/xmla/excel_XP/excel_XP_04_in.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header>
    <XA:Session SessionId="${session.id}" mustUnderstand="1" xmlns:XA="urn:schemas-microsoft-com:xml-analysis"/>
  </Header>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_PROPERTIES</RequestType>
      <Restrictions>
        <RestrictionList>
          <PropertyName>ProviderVersion</PropertyName>
        </RestrictionList>
      </Restrictions>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <DataSourceInfo>MondrianFoodMart</DataSourceInfo>
          <Content>SchemaData</Content>
          <Format>Tabular</Format>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
